driver-tests/bpelse/repeatuntil/RepeatuntilJbi/test/ForEachwithRepeatTest29/Input.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:for="http://j2ee.netbeans.org/wsdl/ForEachwithRepeat">
  <soapenv:Body>
    <for:Name>Test</for:Name>
    <for:Counter>2</for:Counter>
  </soapenv:Body>
</soapenv:Envelope>